emimacs.org
* Org-Mode
Org-Mode is probably one of the most common reasons for using emacs. It's capabilities for a plethora of different things make it an astounding piece of software, and as I am sure you might have noticed, this entire config file was written using org-mode as well.

Some setup regarding font-siyes, what fonts to use when etc. is needed and produces some fairly ugly functions, but it is clearly worth it.

#+begin_src emacs-lisp
(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

(defun emimacs/org-font-config ()
  (dolist (face '((org-level-1 . 1.5)
                  (org-level-2 . 1.25)
                  (org-level-3 . 1.15)
                  (org-level-4 . 1.10)
                  (org-level-5 . 1.05)
                  (org-level-6 . 1.05)
                  (org-level-7 . 1.05)
                  (org-level-8 . 1.05)))
    (set-face-attribute (car face) nil :font emimacs/default-variable-font :weight 'regular :height (cdr face)))

  (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
  (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
  (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))
#+end_src

We also need to enable certain minor modes so org-mode does not rely on monospaced fonts, and to make it's auto-indentation do what it should.

#+begin_src emacs-lisp
(defun emimacs/org-mode-setup ()
  (org-indent-mode 1)
  (variable-pitch-mode 1)
  (visual-line-mode 1))
#+end_src

Now we can use the package itself. Note that adding folders for the agenda manually most likely is not the most straightforward way here, I will look over this in the future.

#+begin_src emacs-lisp
(use-package org
  :hook (org-mode . emimacs/org-mode-setup)
  :config
  (emimacs/org-font-config)
  (setq org-agenda-start-with-log-mode t)
  (require 'org-habit)
  
  :custom
  (org-ellipsis " ")
  (org-log-done 'time)
  (org-log-into-drawer t)
  (org-agenda-files '("~/Orgfiles" "~/Orgfiles/Projects" "~/Orgfiles/Literature" "~/Orgfiles/University"))
  (org-todo-keywords
    '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")))) 
#+end_src

*** org-bullets

The normal bullet-points by org-mode start looking a bit weird at deeper nesting. The org-bullets package helps there.

#+begin_src emacs-lisp
(use-package org-bullets
 :after org
 :hook (org-mode . org-bullets-mode)
 :custom
 (org-bullets-bullet-list '("◉" "●" "⋄")))
#+end_src

** Visual Fill

To make editing orgfiles more akin to a text processor, visual fill adds padding to the text on the sides.

#+begin_src emacs-lisp
(defun emimacs/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . emimacs/org-mode-visual-fill))
#+end_src

** Babel
Babel is an incredibly powerful package, allowing for code blocks to be evaluated and tangled from within org files, thus also powering this very configuration file.

#+begin_src emacs-lisp
;; org-babel
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (scheme . t)))

(setq org-confirm-babel-evaluate nil)
#+end_src

** Tempo
Always typing out the syntax of code blocks by hand is fairly tiresome, tempo alleviating this by allowing for quick macros which extend to the wanted code block.

#+begin_src emacs-lisp
  ;; Structure Templates
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
  (add-to-list 'org-structure-template-alist '("rs" . "src rust"))
#+end_src

We also set up this very file here to automatically be tangled, to make it easily usable as emacs core configuration file.

#+begin_src emacs-lisp
  ;; Auto-Tangle Config File
  (defun emimacs/org-babel-auto-tangle ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/Repositories/emimacs/emimacs.org"))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'emimacs/org-babel-auto-tangle)))
#+end_src


** Dashboard
Having a nice dashboard is pretty neat, especially for always keeping todos and other things tracked using org-mode in mind, as well as recently opened files. Also one more thing to customize later down the line.

#+begin_src emacs-lisp
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))
#+end_src

** Other Adjustments

On my system, some issues with text indentation occur, probably due to the font used. This is easily fixed.

#+begin_src emacs-lisp
;; Fixing Org mode indentations
(set-face-attribute 'org-hide nil :inherit 'fixed-pitch)
#+end_src

* Language Specific
Here configurations for working with different programming languages is placed

Generally, we will want to have the lsp package, as while most things made by Microsoft suck bad, this protocol makes auto-completion quite a charm in many editors including emacs.

#+begin_src emacs-lisp
  ;; LSP
  (use-package lsp-mode
    :ensure
    :commands lsp
    :hook  (scala-mode . lsp)
           (c-mode . lsp)
           (c++-mode . lsp)
           (lsp-mode . lsp-lens-mode)
    :custom
    ;; what to use when checking on-save. "check" is default, I prefer clippy
    (lsp-rust-analyzer-cargo-watch-command "clippy")
    (lsp-eldoc-render-all t)
    (lsp-idle-delay 0.6)
    ;; enable / disable the hints as you prefer:
    (lsp-rust-analyzer-server-display-inlay-hints t)
    (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
    (lsp-rust-analyzer-display-chaining-hints t)
    (lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil)
    (lsp-rust-analyzer-display-closure-return-type-hints t)
    (lsp-rust-analyzer-display-parameter-hints nil)
    (lsp-rust-analyzer-display-reborrow-hints nil)
    :config
    (add-hook 'lsp-mode-hook 'lsp-ui-mode)
    ;; Add metals backend for lsp-mode
    (use-package lsp-metals))

  (use-package lsp-ui
    :ensure
    :commands lsp-ui-mode
    :custom
    (lsp-ui-peek-always-show t)
    (lsp-ui-sideline-show-hover t)
    (lsp-ui-doc-enable nil))
#+end_src

DAP Mode allows for nice integrated debugging tools for multiple languages

#+begin_src emacs-lisp
  ;; Use the Debug Adapter Protocol for running tests and debugging
  (use-package dap-mode
    :hook
    (lsp-mode . dap-mode)
    (lsp-mode . dap-ui-mode))
#+end_src

The actual completion user interface is provided by the company package.

#+begin_src emacs-lisp
  ;; Company
  (use-package company
    :hook (scala-mode . company-mode)
    :ensure
    :config
    (setq lsp-completion-provider :capf)
    :custom
    (company-idle-delay 0.5) ;; how long to wait until popup
    ;; (company-begin-commands nil) ;; uncomment to disable popup
    :bind
    (:map company-active-map
                ("C-n". company-select-next)
                ("C-p". company-select-previous)
                ("M-<". company-select-first)
                ("M->". company-select-last) 
     (:map company-mode-map
                 ("<tab>". tab-indent-or-complete)
                 ("TAB". tab-indent-or-complete)
                 ("M-.".'company-complete))))
#+end_src

Snippets can also be quite comfortable, as such we use the yasnippet package.

#+begin_src emacs-lisp
(use-package yasnippet
  :ensure
  :config
  (yas-reload-all)
  (add-hook 'prog-mode-hook 'yas-minor-mode)
  (add-hook 'text-mode-hook 'yas-minor-mode))

(defun company-yasnippet-or-completion ()
  (interactive)
  (or (do-yas-expand)
      (company-complete-common)))

(defun check-expansion ()
  (save-excursion
    (if (looking-at "\\_>") t
      (backward-char 1)
      (if (looking-at "\\.") t
        (backward-char 1)
        (if (looking-at "::") t nil)))))

(defun do-yas-expand ()
  (let ((yas/fallback-behavior 'return-nil))
    (yas/expand)))

(defun tab-indent-or-complete ()
  (interactive)
  (if (minibufferp)
      (minibuffer-complete)
    (if (or (not yas/minor-mode)
            (null (do-yas-expand)))
        (if (check-expansion)
            (company-complete-common)
          (indent-for-tab-command)))))
#+end_src

Linting functionality is provided by flycheck.

#+begin_src emacs-lisp
  (use-package flycheck :ensure
  :init (global-flycheck-mode))
#+end_src

** GNU Guile
Currently working through the SICP book, I am trying my best to learn the Scheme family of LISPs. Most functionality I need is provided by GNU Guile, with Geiser providing the necessary tooling to execute Scheme snippets from within org-files using Org-Babel.

#+begin_src emacs-lisp
;; Scheme
(use-package geiser-guile :ensure t)
#+end_src

*** Parinfer
LISP and parenthesis are a... wild topic.
Parinfer makes things easier for us in that regard.

#+begin_src emacs-lisp
;; Parinfer
(use-package parinfer-rust-mode
  :hook (emacs-lisp-mode scheme-mode)
  :init
  (setq parinfer-rust-auto-download t))
#+end_src

