emimacs.org
** Rust
I enjoy using the Rust language a lot, and the rustic package allows for using it comfortably within emacs.

#+begin_src emacs-lisp
;; Rustic
(use-package rustic
  :ensure
  :bind (:map rustic-mode-map
              ("M-j" . lsp-ui-imenu)
              ("M-?" . lsp-find-references)
              ("C-c C-c l" . flycheck-list-errors)
              ("C-c C-c a" . lsp-execute-code-action)
              ("C-c C-c r" . lsp-rename)
              ("C-c C-c q" . lsp-workspace-restart)
              ("C-c C-c Q" . lsp-workspace-shutdown)
              ("C-c C-c s" . lsp-rust-analyzer-status))
  :config
  ;; uncomment for less flashiness
  ;; (setq lsp-eldoc-hook nil)
  ;; (setq lsp-enable-symbol-highlighting nil)
  ;; (setq lsp-signature-auto-activate nil)

  ;; comment to disable rustfmt on save
  (setq rustic-format-on-save t))
#+end_src

We also want to have inline hints displayed for our code.

#+begin_src emacs-lisp
(setq lsp-rust-analyzer-server-display-inlay-hints t)
#+end_src

*** TODO Debugging

** $\LaTeX$
Working with LaTeX in orgmode is a charm due to it's preview features. This does sometimes have it's issues in terms of scale on my screen, therefore needing to be increased.

#+begin_src emacs-lisp
;; Org Latex Preview Scale
(setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))
#+end_src

** Python
Elpy provides pretty much all python functionality needed.

#+begin_src emacs-lisp
    (use-package elpy
      :ensure t
      :init
      (elpy-enable)
      :config
      (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
      (add-hook 'elpy-mode-hook 'flycheck-mode))
#+end_src

PEP-8 isn't fun to ensure by hand, blacken does that for us.

#+begin_src emacs-lisp
(use-package blacken)
#+end_src

** Haskell
#+begin_src emacs-lisp
(use-package haskell-mode)
#+end_src

** Scala

#+begin_src emacs-lisp
  ;; Enable scala-mode for highlighting, indentation and motion commands
  (use-package scala-mode
     :interpreter ("scala" . scala-mode))

  ;; Enable sbt mode for executing sbt commands
  (use-package sbt-mode
     :commands sbt-start sbt-command
     :config
     ;; WORKAROUND: https://github.com/ensime/emacs-sbt-mode/issues/31
     ;; allows using SPACE when in the minibuffer
     (substitute-key-definition
       'minibuffer-complete-word
       'self-insert-command
       minibuffer-local-completion-map)
      ;; sbt-supershell kills sbt-mode:  https://github.com/hvesalai/emacs-sbt-mode/issues/152
      (setq sbt:program-options '("-Dsbt.supershell=false")))


  ;; Posframe is a pop-up tool that must be manually installed for dap-mode
  (use-package posframe)

#+end_src

** C/C++
#+begin_src emacs-lisp
(setq-default c-basic-offset 2)
#+end_src
